BackEnd/app/Models/ProductoModel.php

SELECT *
FROM `productos`
WHERE `categoria_id` = '3'
---
    public function getByCategoria($categoriaId)
    {
        return $this->where('categoria_id', $categoriaId)->findAll();