BackEnd/app/Models/UsuarioModel.php

    public function getUserByUsuario(string $usuario): object|array|null
    {
        return $this->where('usuario', $usuario)->first();
---
SELECT *
FROM `usuarios`
WHERE `usuario` = 'superadmin'
 LIMIT 1