BackEnd/app/Controllers/CategoriaController.php

    public function getCategorias()
    {
        $categoriaModel = new CategoriaModel();
        $categorias = $categoriaModel->findAll();
---
SELECT *
FROM `categorias`