BackEnd/app/Controllers/ProductoController.php

    public function getProducts()
    {
        $categoriaId = $this->request->getGet('categoria_id');
        if ($categoriaId) {
            return $this->getByCategorias($categoriaId);
        } else {
            $productos = $this->model->findAll();
            $categorias = $this->categoriaModel->findAll();
---
SELECT *
FROM `categorias`

    public function getCategorias() {
        $categoriaModel = new CategoriaModel();
        $categorias = $categoriaModel->findAll();
---
SELECT *
FROM `categorias`

    public function getByCategorias($categoriaId)
    {
        $productos = $this->model->where('categoria_id', $categoriaId)->findAll();
        $categoria = $this->categoriaModel->find($categoriaId);
---
SELECT *
FROM `categorias`
WHERE `categorias`.`id` = '2'