BackEnd/app/Controllers/UsuarioController.php

SELECT *
FROM `usuarios`
---
    public function cambiarRol($id)
    {
        $usuarioSesion = $this->session->get('usuario');